In [1]:
import pandas as pd
import os

log = pd.read_csv('log.csv', header=None)
log.columns = ['user_id', 'time', 'bet', 'win']
log.head()
log_win = log[log.win.notna()]
log_win

,user_id,time,bet,win
14,Запись пользователя № - user_917,[2019-01-02 8:57:36,145732.0,1987653.0
29,Запись пользователя № - user_942,[2019-01-04 13:59:42,1678321.0,9876543.0
151,Запись пользователя № - user_982,[2019-01-16 21:54:22,100.0,4749.0
189,Запись пользователя № - user_964,[2019-01-21 18:34:44,200.0,4667.0
205,Запись пользователя № - user_931,[2019-01-22 5:26:59,300.0,4319.0
...,...,...,...,...
981,#error,NaN,800.0,7035.0
986,#error,NaN,10454.0,29972.0
987,#error,NaN,10554.0,31634.0
991,Запись пользователя № - user_965,[2019-04-20 12:55:41,800.0,6927.0
996,#error,NaN,10054.0,29265.0

In [2]:
sample = pd.read_csv('sample.csv')
columns = sample.columns
display(columns)

sample.columns = [column.lower() for column in sample.columns]
sample.info()
sample.profession.unique()

Index(['Name', 'City', 'Age', 'Profession'], dtype='object')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        10 non-null     object
 1   city        10 non-null     object
 2   age         11 non-null     int64
 3   profession  11 non-null     object
dtypes: int64(1), object(3)
memory usage: 480.0+ bytes

array(['Клинер', 'Менеджер', 'Водитель', 'Рабочий'], dtype=object)

In [3]:
users = pd.read_csv('users.csv', delimiter = '\t', encoding = 'koi8_r')
users
users.head()

     Юзверь                 мейл        Гео
0  User_943  Accumanst@gmail.com     Ижевск
1  User_908    Advismowr@mail.ru     Ижевск
2  User_962      Anachso@ukr.net  Краснодар
3  User_973     Antecia@inbox.ru      Пермь
4  User_902   Balliaryva@ukr.net        NaN

In [63]:
users.columns = ['user_id', 'email', 'geo']
#log.user_id.unique()
log2 = log.query('bet < 2000 & win > 0')
log2

                              user_id                  time     bet     win
151  Запись пользователя № - user_982  [2019-01-16 21:54:22   100.0  4749.0
189  Запись пользователя № - user_964  [2019-01-21 18:34:44   200.0  4667.0
205  Запись пользователя № - user_931   [2019-01-22 5:26:59   300.0  4319.0
232  Запись пользователя № - user_998   [2019-01-25 8:57:20   500.0  5069.0
265  Запись пользователя № - user_998  [2019-01-29 10:37:55   500.0  6294.0
..                                ...                   ...     ...     ...
962  Запись пользователя № - user_976  [2019-04-19 14:18:45   400.0  5997.0
965  Запись пользователя № - user_900  [2019-04-19 19:31:48   900.0  6767.0
967  Запись пользователя № - user_975  [2019-04-19 22:25:15  1000.0  6108.0
981                            #error                   NaN   800.0  7035.0
991  Запись пользователя № - user_965  [2019-04-20 12:55:41   800.0  6927.0

[113 rows x 4 columns]

In [60]:
sample2 = sample[sample.age < 30]
sample2 = sample[(sample.age < 30) & (sample.profession == 'Рабочий')]
sample2

       name    city  age profession
5  Кузнецов    Сочи   19    Рабочий
6     Сажин  Сургут   29    Рабочий

In [69]:
sample = pd.read_csv("sample.csv")
sample3 = sample[sample.City.str.contains('о', na=False)]
sample3
sample4 = sample[~sample.City.str.contains('о', na=False)]
sample4

       Name    City  Age Profession
4   _______   Курск   50   Водитель
6     Сажин  Сургут   29    Рабочий
9    Левина     NaN   55    Рабочий
10     Фикс    Рига   42    Рабочий

In [71]:
log = pd.read_csv("log.csv",header=None)
log.columns = ['user_id','time', 'bet','win']
new_log = log[~log.user_id.str.contains('error', na=False)]
new_log

                              user_id                  time      bet     win
0    Запись пользователя № - user_919  [2019-01-01 14:06:51      NaN     NaN
1    Запись пользователя № - user_973  [2019-01-01 14:51:16      NaN     NaN
2    Запись пользователя № - user_903  [2019-01-01 16:31:16      NaN     NaN
3    Запись пользователя № - user_954  [2019-01-01 17:17:51      NaN     NaN
4    Запись пользователя № - user_954  [2019-01-01 21:31:18      NaN     NaN
..                                ...                   ...      ...     ...
991  Запись пользователя № - user_965  [2019-04-20 12:55:41    800.0  6927.0
992  Запись пользователя № - user_967  [2019-04-20 14:59:36  10154.0     NaN
993  Запись пользователя № - user_973  [2019-04-20 17:09:56  10254.0     NaN
994  Запись пользователя № - user_977  [2019-04-20 18:10:07  10354.0     NaN
995  Запись пользователя № - user_984   [2019-04-20 9:59:58   9754.0     NaN

[985 rows x 4 columns]

In [76]:
sample = pd.read_csv("sample.csv")
sample2 = sample 
sample2['Age'] = sample2.Age.apply(lambda x: x+1)

In [77]:
sample = pd.read_csv("sample.csv")
sample2 = sample
sample2['City'] = sample2.City.apply(lambda s: str(s).lower())
sample2

            Name         City  Age Profession
0         Иванов       москва   25     Клинер
1            NaN    волгоград   31   Менеджер
2         Иванов       москва   25     Клинер
3        sidorov  владивосток   43   Менеджер
4        _______        курск   50   Водитель
5       Кузнецов         сочи   19    Рабочий
6          Сажин       сургут   29    Рабочий
7   Котлеревский   йошкар-ола   32    Рабочий
8     Завалишина    чебоксары   36   Менеджер
9         Левина          nan   55    Рабочий
10          Фикс         рига   42    Рабочий

In [86]:
def profession_code(s):
     if s == 'Рабочий':
        return 0
     elif s == 'Менеджер':
        return 1
     else:
        return 2
sample2 = sample
sample2['Profession'] = sample2.Profession.apply(profession_code)
sample2

            Name         City  Age  Profession
0         Иванов       москва   25           2
1            NaN    волгоград   31           1
2         Иванов       москва   25           2
3        sidorov  владивосток   43           1
4        _______        курск   50           2
5       Кузнецов         сочи   19           0
6          Сажин       сургут   29           0
7   Котлеревский   йошкар-ола   32           0
8     Завалишина    чебоксары   36           1
9         Левина          nan   55           0
10          Фикс         рига   42           0

In [87]:
def age_category(age):
    if age < 23:
        return 'молодой'
    elif 23 <= age <= 35:
        return 'средний'
    else:
        return 'зрелый'

In [89]:
sample = pd.read_csv("sample.csv")
sample['Age_category'] = sample.Age.apply(age_category)
sample

            Name         City  Age Profession Age_category
0         Иванов       Москва   25     Клинер      средний
1            NaN    Волгоград   31   Менеджер      средний
2         Иванов       Москва   25     Клинер      средний
3        sidorov  Владивосток   43   Менеджер       зрелый
4        _______        Курск   50   Водитель       зрелый
5       Кузнецов         Сочи   19    Рабочий      молодой
6          Сажин       Сургут   29    Рабочий      средний
7   Котлеревский   Йошкар-Ола   32    Рабочий      средний
8     Завалишина    Чебоксары   36   Менеджер       зрелый
9         Левина          NaN   55    Рабочий       зрелый
10          Фикс         Рига   42    Рабочий       зрелый

In [94]:
def user_id_cut(user_id):
    if user_id == '#error':
        return ''
    else:
        pos = user_id.find('u')
        return user_id[pos:]

log = pd.read_csv("log.csv",header=None)
log.columns = ['user_id','time', 'bet','win']
log['user_id'] = log.user_id.apply(user_id_cut)
log

      user_id                  time      bet      win
0    user_919  [2019-01-01 14:06:51      NaN      NaN
1    user_973  [2019-01-01 14:51:16      NaN      NaN
2    user_903  [2019-01-01 16:31:16      NaN      NaN
3    user_954  [2019-01-01 17:17:51      NaN      NaN
4    user_954  [2019-01-01 21:31:18      NaN      NaN
..        ...                   ...      ...      ...
995  user_984   [2019-04-20 9:59:58   9754.0      NaN
996                             NaN  10054.0  29265.0
997                             NaN  10454.0      NaN
998                             NaN   1000.0      NaN
999                             NaN  10754.0      NaN

[1000 rows x 4 columns]

In [98]:
log = pd.read_csv("log.csv",header=None) 
log.columns = ['user_id','time','bet','win']
t = log.time[0]
t = t[t.find('[')+1:]
t

'2019-01-01 14:06:51'

In [111]:
def time_cut(str: t):
    pos = t.find('[')
    return t[pos+1:]



log = pd.read_csv("log.csv",header=None) 
log.columns = ['user_id','time','bet','win']
log['time'] = log.time.apply(time_cut)
log

                              user_id                 time      bet      win
0    Запись пользователя № - user_919  2019-01-01 14:06:51      NaN      NaN
1    Запись пользователя № - user_973  2019-01-01 14:06:51      NaN      NaN
2    Запись пользователя № - user_903  2019-01-01 14:06:51      NaN      NaN
3    Запись пользователя № - user_954  2019-01-01 14:06:51      NaN      NaN
4    Запись пользователя № - user_954  2019-01-01 14:06:51      NaN      NaN
..                                ...                  ...      ...      ...
995  Запись пользователя № - user_984  2019-01-01 14:06:51   9754.0      NaN
996                            #error  2019-01-01 14:06:51  10054.0  29265.0
997                            #error  2019-01-01 14:06:51  10454.0      NaN
998                            #error  2019-01-01 14:06:51   1000.0      NaN
999                            #error  2019-01-01 14:06:51  10754.0      NaN

[1000 rows x 4 columns]

In [21]:
def time_cut(time):
    return time[1:]
    
def user_id_cut(user_id):
    pos = user_id.find('u')
    return user_id[pos:]

log = pd.read_csv("log.csv",header=None) 
log.columns = ['user_id','time','bet','win']
log = log.query('user_id != "#error"')
log['user_id'] = log.user_id.apply(user_id_cut)
log['time'] = log.time.apply(time_cut)
log

      user_id                 time      bet     win
0    user_919  2019-01-01 14:06:51      NaN     NaN
1    user_973  2019-01-01 14:51:16      NaN     NaN
2    user_903  2019-01-01 16:31:16      NaN     NaN
3    user_954  2019-01-01 17:17:51      NaN     NaN
4    user_954  2019-01-01 21:31:18      NaN     NaN
..        ...                  ...      ...     ...
991  user_965  2019-04-20 12:55:41    800.0  6927.0
992  user_967  2019-04-20 14:59:36  10154.0     NaN
993  user_973  2019-04-20 17:09:56  10254.0     NaN
994  user_977  2019-04-20 18:10:07  10354.0     NaN
995  user_984   2019-04-20 9:59:58   9754.0     NaN

[985 rows x 4 columns]

In [12]:
len(log[log.time.isna()])

0

# Mодуль 11 feature ingenering

In [22]:
log = pd.read_csv("log.csv",header=None) 
log.columns = ['user_id','time','bet','win']
len(log[log.time.isna()])

15